{
  "auto_mapping": null,
  "base_model_name_or_path": "facebook/bart-large-cnn",
  "inference_mode": true,
  "modules_to_save": null,
  "num_attention_heads": 16,
  "num_layers": 12,
  "num_transformer_submodules": 2,
  "num_virtual_tokens": 40,
  "peft_type": "PROMPT_TUNING",
  "prompt_tuning_init": "RANDOM",
  "prompt_tuning_init_text": null,
  "revision": null,
  "task_type": "SEQ_2_SEQ_LM",
  "token_dim": 1024,
  "tokenizer_kwargs": null,
  "tokenizer_name_or_path": "facebook/bart-large-cnn"
}